---
title: Lab 2: Avacado Sales
author: Ryan Neely
format:
    html:
        toc: true
        code-fold: true
        embed-resources: true
        echo: true
---

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('avocado-updated-2020.csv')

# Step 1

The data includes information on the prices and sales of avacados by year and region. It also segments the sales by small, large, and extra large bags, as well as by type of avacado.

# Step 2

In [13]:
region_mapping = {
    'Albany': 'Northeast',
    'Boston': 'Northeast',
    'Buffalo/Rochester': 'Northeast',
    'Hartford/Springfield': 'Northeast',
    'Baltimore/Washington': 'Northeast',
    'Philadelphia': 'Northeast',
    'Harrisburg/Scranton':'Northeast',
    'New York':'Northeast',
    'Northern New England':'Northeast',
    'Pittsburgh':'Northeast',
    'Richmond/Norfolk':'Northeast',
    'Roanoke':'Northeast',
    'Syracuse':'Northeast',
    'Northeast':'Northeast',

    'Atlanta': 'South',
    'Charlotte': 'South',
    'Dallas/Ft. Worth': 'South',
    'Houston': 'South',
    'Miami/Ft. Lauderdale': 'South',
    'Nashville': 'South',
    'Orlando': 'South',
    'Raleigh/Greensboro': 'South',
    'Jacksonville':'South',
    'Midsouth':'South',
    'New Orleans/Mobile':'South',
    'South Carolina':'South',
    'Southeast':'South',
    'Tampa':'South',

    'Chicago': 'Midwest',
    'Cincinnati/Dayton': 'Midwest',
    'Columbus': 'Midwest',
    'Detroit': 'Midwest',
    'Indianapolis': 'Midwest',
    'Grand Rapids': 'Midwest',
    'Great Lakes': 'Midwest',
    'Louisville': 'Midwest',
    'Plains':'Midwest',
    'South Central':'Midwest',
    'St. Louis':'Midwest',

    'California': 'West',
    'Denver': 'West',
    'Boise': 'West',
    'Phoenix/Tucson': 'West',
    'Portland': 'West',
    'Seattle': 'West',
    'Las Vegas': 'West',
    'San Francisco': 'West',
    'Los Angeles': 'West',
    'San Diego':'West',
    'Sacramento':'West',
    'Spokane':'West',
    'West Tex/New Mexico':'West',
    'West':'West',

    'Total U.S.':'Total'
}

df['region'] = df['geography'].map(region_mapping)

In [27]:
df.rename(columns = {
    '4046':'small', '4225':'medium', '4770':'large'},
    inplace=True
)

         date  average_price  ...             geography     region
0  2015-01-04           1.22  ...                Albany  Northeast
1  2015-01-04           1.79  ...                Albany  Northeast
2  2015-01-04           1.00  ...               Atlanta      South
3  2015-01-04           1.76  ...               Atlanta      South
4  2015-01-04           1.08  ...  Baltimore/Washington  Northeast

[5 rows x 14 columns]